{
    "name": "Kevin Causado Barón",
    "logo_name": "kevin-causado",
    "role": "Desarrollador de Software",
    "about": {
        "sections": {
            "professional-info": {
                "title": "professional-info",
                "icon": "icons/info-professional.svg",
                "info": {
                    "experience": {
                        "title": "experience",
                        "description": "<br>Tengo experiencia en el desarrollo de soluciones de software robustas y escalables. He trabajado en el backend implementando funcionalidades y dando soporte a plataformas de logística en proyectos internacionales. <br><br> Como desarrollador freelancer, he liderado la creación de dashboards de análisis avanzado para la monitorización de sensores (VibrAi), implementando desde la autenticación y control de acceso con Supabase, hasta la visualización de datos en tiempo real con Vue.js. Además, he participado en el mantenimiento y optimización de aplicaciones de gestión de salud (Salud System) con Angular, mejorando su rendimiento y la integración con APIs RESTful."
                    },
                    "hard-skills": {
                        "title": "hard-skills",
                        "description": "<br>Mi stack tecnológico incluye una sólida experiencia en el <b>backend</b> con <b>Node.js, Express, Laravel y .NET</b>. En el <b>frontend</b>, domino frameworks modernos como <b>React.js, Angular.js y Vue.js 3 (Composition API)</b>, especializándome en el ecosistema de <b>Nuxt.js</b>. <br><br> Tengo un manejo avanzado de bases de datos <b>SQL</b>, principalmente <b>PostgreSQL</b> a través de servicios como <b>Supabase</b>, y experiencia en la gestión de estado de aplicaciones con herramientas como <b>Pinia</b>. Estoy familiarizado con la creación e integración de <b>APIs RESTful</b> y el uso de herramientas de diseño como <b>Tailwind CSS</b>."
                    },
                    "soft-skills": {
                        "title": "soft-skills",
                        "description": "<br>Me considero una persona con una gran capacidad para la <b>resolución de problemas</b>, tanto a nivel técnico como funcional. Mi experiencia en distintos proyectos me ha permitido desarrollar una <b>comunicación efectiva</b> y una fuerte habilidad para el <b>trabajo en equipo</b>. <br><br> Soy proactivo, organizado y me apasiona el <b>aprendizaje continuo</b>, lo que me impulsa a mantenerme siempre actualizado con las últimas tendencias y tecnologías del sector."
                    }
                }
            },
            "personal-info": {
                "title": "personal-info",
                "icon": "icons/info-personal.svg",
                "info": { 
                    "bio": {
                        "title": "bio",
                        "description": "<br>¡Hola! Soy Kevin, un Tecnólogo en Análisis y Desarrollo de Software apasionado por construir soluciones digitales que aporten valor. Me encanta enfrentar los desafíos que supone el ciclo completo de desarrollo de una aplicación, desde la concepción de la lógica en el servidor hasta la creación de una interfaz de usuario intuitiva y atractiva. <br><br> Disfruto convirtiendo ideas complejas en software funcional y eficiente, siempre buscando la mejor herramienta para cada tarea."
                    },
                    "intereses": {
                        "title": "intereses",
                        "description": "<br>Además de la programación, me interesa el mundo de la tecnología en general, las arquitecturas de software y las buenas prácticas de desarrollo. En mi tiempo libre, disfruto explorando nuevas librerías, contribuyendo a pequeños proyectos open-source y aprendiendo sobre inteligencia artificial."
                    },
                    "educación": {
                        "title": "educación",
                        "description": "<br>Soy <b>Tecnólogo en Análisis y Desarrollo de Software</b>, graduado del <b>SENA (2022)</b>. Mi formación me ha proporcionado una base sólida en el ciclo de vida del software, metodologías ágiles y los fundamentos de la ingeniería de software para crear productos de alta calidad. <br><br> Adicionalmente, cuento con un nivel de inglés intermedio que me permite consumir documentación técnica y colaborar en entornos bilingües.",
                        "files": {
                            "universidad": "Tecnólogo en Análisis y Desarrollo de Software - SENA"
                        }
                    }
                }
            },
            "hobbies-info": {
                "title": "hobbies-info",
                "icon": "icons/info-hobbies.svg",
                "info": {
                    "deportes": {
                        "title": "deportes",
                        "description": "<br>Amo el futbol, me cuido bastante haciendo ejercicio en el gym."
                    },
                    "videojuegos": {
                        "title": "videojuegos",
                        "description": "<br>Juegos de estrategia y peleas."
                    }
                }
            }
        }
    },
    "contacts": {
        "direct": {
            "title": "contacto",
            "sources": {
                "email": "devsolving@gmail.com",
                "phone": "+573152089391"
            }
        },
        "social": {
            "github": {
                "title": "Github profile",
                "url": "https://github.com/",
                "user": "KevinCausado"
            },
            "linkedin": {
                "title": "Perfil de LinkedIn",
                "url": "https://www.linkedin.com/in/kevin-causado/",
                "user": "kevin-causado"
            }
        }
    },
    "gists": {
        "1": "83861a67e377633ee8368df01ee3a355",
        "2": "694c1f32332788a2ac7f37b09e5aa40e"
    },
    "projects": {
        "1": {
            "title": "VibrAi - Dashboard de Sensores",
            "description": "Dashboard de análisis avanzado para visualizar lecturas de múltiples sensores por activo, mostrando su estado y permitiendo la configuración de perfiles de vibración. Incluye autenticación, roles de usuario y actualizaciones en tiempo real.",
            "img": "/images/projects/VIBRAI.png",
            "tech": ["Vue", "Nuxt.js", "Pinia", "Supabase", "PostgreSQL", "Tailwind CSS"],
            "url": "https://vibrai.miobox.io/"
        },
        "2": {
            "title": "Salud System - Frontend App",
            "description": "Desarrollo y mantenimiento del frontend para una aplicación de salud, enfocado en optimizar la carga y el rendimiento. Integración de APIs RESTful para la sincronización de datos y la implementación de formularios dinámicos para gestión contable.",
            "img": "/images/projects/INFOTEC.png",
            "tech": ["Angular", "TypeScript", "RESTful API"],
            "url": "http://167.114.33.38:8076/#/zafiro"
        },
        "3": {
            "title": "Plataforma Multientrega (Panamá)",
            "description": "Desarrollo backend para una plataforma logística. Mis responsabilidades incluyeron la implementación de nuevas funcionalidades críticas para la operación y el soporte técnico continuo de la plataforma.",
            "img": "/images/projects/MULTIENTREGA.png",
            "tech": ["Node.js", "Express.js", "Backend","Angular"],
            "url": "https://multientregapanama.com/"
        }
    }
}
